BenchProducer.log
docker exec kafka_1 kafka-producer-perf-test --topic test-345 --num-record 5000 --throughput 210 --producer.config=/etc/kafka/producer.properties --payload-file=/etc/kafka/gcc_log.txt
Reading payloads from: /etc/kafka/gcc_log.txt
Number of messages read: 541
1051 records sent, 210.1 records/sec (0.01 MB/sec), 3.7 ms avg latency, 454.0 max latency.
1052 records sent, 210.3 records/sec (0.01 MB/sec), 2.3 ms avg latency, 21.0 max latency.
1051 records sent, 210.1 records/sec (0.01 MB/sec), 3.3 ms avg latency, 55.0 max latency.
1051 records sent, 210.0 records/sec (0.01 MB/sec), 2.0 ms avg latency, 12.0 max latency.
5000 records sent, 209.925267 records/sec (0.01 MB/sec), 2.69 ms avg latency, 454.00 ms max latency, 2 ms 50th, 6 ms 95th, 17 ms 99th, 43 ms 99.9th.